<a href="https://colab.research.google.com/github/NicoPatalagua/Pandas/blob/master/PandasExercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas Exercises**
## *Patalagua Suárez Nicolás*
### Universidad Sergio Arboleda

### ***What is Pandas?***

In Computing and Data Science, pandas is a software library written as an extension to NumPy for data manipulation and analysis for the Python programming language. In particular, it offers data structures and operations for number tables and time series. It is free software distributed under the BSD version three clauses license.

 https://pandas.pydata.org/

### ***What is Numpy?***

NumPy is a Python extension, which adds more support for vectors and matrices, constituting a library of high-level mathematical functions to operate with those vectors or matrices. NumPy's ancestor Numeric was originally created by Jim Hugunin with some contributions from other developers. In 2005 Travis Oliphant created NumPy incorporating Numarray features into NumPy with some modifications.


 https://numpy.org/

### ***Repository***
This work was done taking into account the repository https://github.com/guipsamora/pandas_exercises, developed by Guilherme Samora, who is a Senior Product Manager at the Global Savings Group in Munich - Germany.

## ***Getting and knowing***

### ***Chiotle***

Dataset and materials: https://github.com/justmarkham

**Step 1.** *Import the necessary libraries*

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** *Import the dataset from this address.*

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

**Step 3.** *Assign it to a variable called chipo.*

In [0]:
#Create the variable chipo
chipo = pd.read_csv(dataset, sep = '\t')

**Step 4.** *See the first 10 entries.*

In [0]:
#With head we show a specific amount of data
chipo.head(10)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98
5         3  ...     $10.98
6         3  ...      $1.69
7         4  ...     $11.75
8         4  ...      $9.25
9         5  ...      $9.25

[10 rows x 5 columns]

**Step 5.** *What is the number of observations in the dataset?*

In [0]:
#With shape with a 0 we can show the number of rows in the file
chipo.shape[0]

4622

**Step 6.** *What is the number of columns in the dataset?*

In [0]:
#With shape with a 1 we can show the number of columns in the file
chipo.shape[1]

5

**Step 7.** *Print the name of all the columns.*

In [0]:
#If we add columns to the variable that reads the file, it prints the name of the columns
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

**Step 8.** *How is the dataset indexed?*

In [0]:
#The index method returns the number of indexes of the variable
chipo.index

RangeIndex(start=0, stop=4622, step=1)

**Step 9.** *Which was the most-ordered item?*

In [0]:
#Group by items with groupby,Sum the grouped data with the previous method 
#and Order the values ​​by quantity
ObjItem= chipo.groupby('item_name').sum().sort_values(['quantity'], ascending=False)
#Print the Item most-ordered
ObjItem.iloc[0,0:0]

Series([], Name: Chicken Bowl, dtype: int64)

**Step 10.** *For the most-ordered item, how many items were ordered?*

In [0]:
#Print Quantity of ordered items
ObjItem.iloc[0,1]

761

**Step 11.** *What was the most ordered item in the choice_description column?*

In [0]:
#Group by items with groupby,Sum the grouped data with the previous method 
#and Order the values ​​by quantity
ObjItem= chipo.groupby('choice_description').sum().sort_values(['quantity'], ascending=False)
#Print the Item most-ordered
ObjItem.iloc[0,0:1]

order_id    123455
Name: [Diet Coke], dtype: int64

**Step 12.** *How many items were orderd in total?*

In [0]:
#Count the quantity of items ordered with the quantity column
chipo.quantity.sum()

4972

**Step 13.** *Turn the item price into a float.*

> **a.** *Check the item price type.*

In [0]:
#with the dtype method we return the data type of the selected column
chipo.item_price.dtype

dtype('O')



> **b.** *Create a lambda function and change the type of item price.*

In [0]:
#Assign the column itemprice to chipo and later we apply the lambda function
chipo.item_price=chipo.item_price.apply(lambda x: float(x[1:-1]))


>**c.** *Check the item price type.*

In [0]:
#recheck data type
chipo.item_price.dtype

dtype('float64')

**Step 14.** *How much was the revenue for the period in the dataset?*

In [0]:
#We multiply the quantity by the price and add the result
(chipo['quantity']*chipo['item_price']).sum()

39237.02

**Step 15.** *How many orders were made in the period?*

In [0]:
#Count the number of order data with valuecounts
#With count return the length that corresponds to the number of orders
chipo.order_id.value_counts().count()

1834

**Step 16.** *What is the average revenue amount per order?*

In [0]:
#With the group method ordered by order_id, 
#Add the data and get the average (Specify revenue)
chipo.groupby('order_id').sum().mean()['revenue']

21.394231188658654

**Step 17.** *How many different items are sold?*

In [0]:
#Count the number of different items 
#Count the number of items obtained
chipo.item_name.value_counts().count()

50

### ***Occupation***

Dataset and materials: https://github.com/justmarkham

**Step 1.** *Import the necessary libraries.*

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** *Import the dataset from this address.*

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

**Step 3.** *Assign it to a variable called users and use the 'user_id' as index.*

In [0]:
#Create the variable users and use user_id as index
users = pd.read_csv(dataset, sep='|', index_col='user_id')

**Step 4.** *See the first 25 entries.*

In [0]:
#With head we show a specific amount of data
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

**Step 5.** *See the last 10 entries.*

In [0]:
#The head method returns the header, however tail returns the data at the end of a file.
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

**Step 6.** *What is the number of observations in the dataset?*

In [0]:
#With shape with a 0 we can show the number of rows in the file
users.shape[0]

943

**Step 7.** *What is the number of columns in the dataset?*

In [0]:
#With shape with a 1 we can show the number of columns in the file
users.shape[1]

4

**Step 8.** *Print the name of all the columns.*

In [0]:
#If we add columns to the variable that reads the file, it prints the name of the columns
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

**Step 9.** *How is the dataset indexed?*

In [0]:
#The index method returns the indexing of the dataset
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

**Step 10.** *What is the data type of each column?*

In [0]:
#with the dtype method we return the data type of the selected column
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Step 11.** *Print only the occupation column.*

In [0]:
#the required column can be called as a method to return it
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

**Step 12.** *How many different occupations are in this dataset?*

In [0]:
#Adding the count of the differences between data to the previous query achieves what is required in this
users.occupation.value_counts().count()

21

**Step 13.** *What is the most frequent occupation?*

In [0]:
#Show the header of the previous command
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

**Step 14.** *Summarize the DataFrame.*

In [0]:
#With the describe method, this information is obtained
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

**Step 15.** *Summarize all the columns.*

In [0]:
#If everything is defined for the previous query, send the detail of everything
users.describe(include = "all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

**Step 16.** *Summarize only the occupation column.*

In [0]:
#Only the describe method is called
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

**Step 17.** *What is the mean age of users?*

In [0]:
#With the age method and the average method applied to the list of users
users.age.mean()

34.05196182396607

In [0]:
#And it is rounded
round(users.age.mean())

34

**Step 18.** *What is the age with least occurrence?*

In [0]:
#It is counted by age repetitions and the queue is returned from the list
users.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

### ***World Food Facts***


**Step 1.** *Go to https://www.kaggle.com/openfoodfacts/world-food-facts/data*

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** *Download the dataset to your computer and unzip it.*

In [0]:
dataset='en.openfoodfacts.org.products.tsv'

**Step 3.** *Use the tsv file and assign it to a dataframe called food.*

In [0]:
#Create the variable food
food = pd.read_csv(dataset, sep='\t')

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (19,20,24,25,26,28,37,38,39,48) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

**Step 4.** *See the first 5 entries.*

In [0]:
#With head we show a specific amount of data
food.head(5)

    code  ... water-hardness_100g
0   3087  ...                 NaN
1   4530  ...                 NaN
2   4559  ...                 NaN
3  16087  ...                 NaN
4  16094  ...                 NaN

[5 rows x 163 columns]

**Step 5.** *What is the number of observations in the dataset?*

In [0]:
#With shape we can show the number of rows in the file
food.shape

(53805, 163)

**Step 6.** *What is the number of columns in the dataset?*

In [0]:
#With shape with a 0 we can show the number of rows in the file
food.shape[1]

163

**Step 7.** *Print the name of all the columns.*

In [0]:
#If we add columns to the variable that reads the file, it prints the name of the columns
food.columns

Index(['code', 'url', 'creator', 'created_t', 'created_datetime',
       'last_modified_t', 'last_modified_datetime', 'product_name',
       'generic_name', 'quantity',
       ...
       'fruits-vegetables-nuts_100g', 'fruits-vegetables-nuts-estimate_100g',
       'collagen-meat-protein-ratio_100g', 'cocoa_100g', 'chlorophyl_100g',
       'carbon-footprint_100g', 'nutrition-score-fr_100g',
       'nutrition-score-uk_100g', 'glycemic-index_100g',
       'water-hardness_100g'],
      dtype='object', length=163)

**Step 8.** *What is the name of 105th column?*

In [0]:
#The first column begins its count at 0 therefore 104 is required
food.columns[104]

'-glucose_100g'


**Step 9.** *What is the type of the observations of the 105th column?*

In [0]:
#the previous query is called from the dtypes method of the food variable
food.dtypes[food.columns[104]]

dtype('float64')

**Step 10.** *How is the dataset indexed?*

In [0]:
#The index method returns the number of indexes of the variable
food.index

RangeIndex(start=0, stop=53805, step=1)

**Step 11.** *What is the product name of the 19th observation?*

In [0]:
#It's called the observation column and the corresponding row
food.values[18][7]

'Lotus Organic Brown Jasmine Rice'

## ***Filtering and Sorting Data***

### **Euro 12**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** Import the dataset from this address.

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/02_Filtering_%26_Sorting/Euro12/Euro_2012_stats_TEAM.csv'

**Step 3.** Assign it to a variable called euro12.

In [0]:
#Create the variable euro12
euro12 = pd.read_csv(dataset, sep=',')

**Step 4.** Select only the Goal column.

In [0]:
#the required column can be called as a method to return it
euro12.Goals

0      4
1      4
2      4
3      5
4      3
5     10
6      5
7      6
8      2
9      2
10     6
11     1
12     5
13    12
14     5
15     2
Name: Goals, dtype: int64

**Step 5.** How many team participated in the Euro2012?

In [0]:
#With shape with a 0 we can show the number of teams in the file
euro12.shape[0]

16

**Step 6.** What is the number of columns in the dataset?

In [0]:
#With shape with a 1 we can show the number of columns in the file
euro12.shape[1]

35

**Step 7.** View only the columns Team, Yellow Cards and Red Cards and assign them to a dataframe called discipline

In [0]:
#For this, the columns to be called within the square brackets are specified.
euro12[['Team', 'Yellow Cards', 'Red Cards']]

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
6                Greece             9          1
7                 Italy            16          0
8           Netherlands             5          0
9                Poland             7          1
10             Portugal            12          0
11  Republic of Ireland             6          1
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0

**Step 8.** Sort the teams by Red Cards, then to Yellow Cards

In [0]:
#For this, the ordering method is added to the previous query so it is searched
euro12[['Team', 'Yellow Cards', 'Red Cards']].sort_values(['Red Cards', 'Yellow Cards'], ascending = False)

                   Team  Yellow Cards  Red Cards
6                Greece             9          1
9                Poland             7          1
11  Republic of Ireland             6          1
7                 Italy            16          0
10             Portugal            12          0
13                Spain            11          0
0               Croatia             9          0
1        Czech Republic             7          0
14               Sweden             7          0
4                France             6          0
12               Russia             6          0
3               England             5          0
8           Netherlands             5          0
15              Ukraine             5          0
2               Denmark             4          0
5               Germany             4          0

**Step 9.** Calculate the mean Yellow Cards given per Team

In [0]:
#The average method applied to the list of euro12
euro12['Yellow Cards'].mean()

7.4375

In [0]:
#And it is rounded
round(euro12['Yellow Cards'].mean())

7

**Step 10.** Filter teams that scored more than 6 goals

In [0]:
#for this, within the euro variable, the logical operation must be performed
euro12[euro12.Goals > 6]

       Team  Goals  Shots on target  ...  Subs on Subs off Players Used
5   Germany     10               32  ...       15       15           17
13    Spain     12               42  ...       17       17           18

[2 rows x 35 columns]

**Step 11.** Select the teams that start with G

In [0]:
#for this within the variable euro12, we look for the equipment
#that in the search for a G at the beginning returns true
euro12[euro12.Team.str.startswith('G')]

      Team  Goals  Shots on target  ...  Subs on Subs off Players Used
5  Germany     10               32  ...       15       15           17
6   Greece      5                8  ...       12       12           20

[2 rows x 35 columns]

**Step 12.** Select the first 7 columns

In [0]:
#With iloc choose the first row and the columns from 0 to 7
euro12.iloc[0, 0:7]

Team                          Croatia
Goals                               4
Shots on target                    13
Shots off target                   12
Shooting Accuracy               51.9%
% Goals-to-shots                16.0%
Total shots (inc. Blocked)         32
Name: 0, dtype: object

**Step 13.** Select all columns except the last 3.

In [0]:
#With iloc choose the columns -6 to -3 columns
euro12.iloc[0 ,-6:-3]

Offsides        2
Yellow Cards    9
Red Cards       0
Name: 0, dtype: object

**Step 14.** Present only the Shooting Accuracy from England, Italy and Russia

In [0]:
# With loc and the queary
euro12.loc[euro12.Team.isin(['England', 'Italy', 'Russia']), ['Team','Shooting Accuracy']]

       Team Shooting Accuracy
3   England             50.0%
7     Italy             43.0%
12   Russia             22.5%

### **Fictional Army**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** This is the data given as a dictionary

In [0]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

**Step 3.** Create a dataframe and assign it to a variable called army.

In [0]:
#Create the variable army
army = pd.DataFrame(data=raw_data)


**Step 4.** Set the 'origin' colum as the index of the dataframe

In [0]:
#Replace with inplace
army.set_index('origin', inplace=True)

In [0]:
#print army to verify
army.iloc[:,0:0]

Empty DataFrame
Columns: []
Index: [Arizona, California, Texas, Florida, Maine, Iowa, Alaska, Washington, Oregon, Wyoming, Louisana, Georgia]

**Step 5.** Print only the column veterans

In [0]:
#call the veterans column as if it were a method
army.veterans

origin
Arizona         1
California      5
Texas          62
Florida        26
Maine          73
Iowa           37
Alaska        949
Washington     48
Oregon         48
Wyoming       435
Louisana       63
Georgia       345
Name: veterans, dtype: int64

**Step 6.** Print the columns 'veterans' and 'deaths'

In [0]:
#Return the veterans and the dead
army[["veterans", "deaths"]]

            veterans  deaths
origin
Arizona            1     523
California         5      52
Texas             62      25
Florida           26     616
Maine             73      43
Iowa              37     234
Alaska           949     523
Washington        48      62
Oregon            48      62
Wyoming          435      73
Louisana          63      37
Georgia          345      35

**Step 7.** Print the name of all the columns.

In [0]:
#If we add columns to the variable that reads the file,
#it prints the name of the columns
army.columns

Index(['regiment', 'company', 'deaths', 'battles', 'size', 'veterans',
       'readiness', 'armored', 'deserters'],
      dtype='object')

**Step 8.** Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [0]:
#With the loc method make the query
army.loc[["Maine", "Alaska"], ["deaths", "size", "deserters"]]

        deaths  size  deserters
origin
Maine       43  1592          3
Alaska     523   987         24

**Step 9.** Select the rows 3 to 7 and the columns 3 to 6

In [0]:
#Wich iloc choose the columns
army.iloc[2:7, 2:6]

         deaths  battles  size  veterans
origin
Texas        25        2  1099        62
Florida     616        2  1400        26
Maine        43        4  1592        73
Iowa        234        7  1006        37
Alaska      523        8   987       949

**Step 10.** Select every row after the fourth row and all columns

In [0]:
#Wich iloc choose the columns and rows
army.iloc[4:, :]

            regiment company  deaths  ...  readiness  armored  deserters
origin                                ...
Maine       Dragoons     1st      43  ...          2        0          3
Iowa        Dragoons     1st     234  ...          1        1          4
Alaska      Dragoons     2nd     523  ...          2        0         24
Washington  Dragoons     2nd      62  ...          3        1         31
Oregon        Scouts     1st      62  ...          2        0          2
Wyoming       Scouts     1st      73  ...          1        0          3
Louisana      Scouts     2nd      37  ...          2        1          2
Georgia       Scouts     2nd      35  ...          3        1          3

[8 rows x 9 columns]

**Step 11.** Select every row up to the 4th row and all columns

In [0]:
#Wich iloc choose the columns and rows
army.iloc[:4, :]

              regiment company  deaths  ...  readiness  armored  deserters
origin                                  ...
Arizona     Nighthawks     1st     523  ...          1        1          4
California  Nighthawks     1st      52  ...          2        0         24
Texas       Nighthawks     2nd      25  ...          3        1         31
Florida     Nighthawks     2nd     616  ...          3        1          2

[4 rows x 9 columns]

**Step 12.** Select the 3rd column up to the 7th column

In [0]:
#Wich iloc choose the columns and rows
army.iloc[:,2:7]

            deaths  battles  size  veterans  readiness
origin
Arizona        523        5  1045         1          1
California      52       42   957         5          2
Texas           25        2  1099        62          3
Florida        616        2  1400        26          3
Maine           43        4  1592        73          2
Iowa           234        7  1006        37          1
Alaska         523        8   987       949          2
Washington      62        3   849        48          3
Oregon          62        4   973        48          2
Wyoming         73        7  1005       435          1
Louisana        37        8  1099        63          2
Georgia         35        9  1523       345          3

**Step 13.** Select rows where df.deaths is greater than 50

In [0]:
#In the army variable we perform the logical operation
army[army["deaths"] > 50].iloc[:,2:3]

            deaths
origin
Arizona        523
California      52
Florida        616
Iowa           234
Alaska         523
Washington      62
Oregon          62
Wyoming         73

**Step 14.** Select rows where df.deaths is greater than 500 or less than 50

In [0]:
#In the army variable we perform the logical operation
army[(army["deaths"] > 500) | (army["deaths"] < 50)].iloc[:,2:3]

          deaths
origin
Arizona      523
Texas         25
Florida      616
Maine         43
Alaska       523
Louisana      37
Georgia       35

**Step 15.** Select all the regiments not named "Dragoons"

In [0]:
#In the army variable we perform the logical operation
army[army["regiment"] != "Dragoons"].iloc[:,0]

origin
Arizona       Nighthawks
California    Nighthawks
Texas         Nighthawks
Florida       Nighthawks
Oregon            Scouts
Wyoming           Scouts
Louisana          Scouts
Georgia           Scouts
Name: regiment, dtype: object

**Step 16.** Select the rows called Texas and Arizona

In [0]:
#In the army variable we perform the logical operation and use loc
army.loc[["Texas", "Arizona"]].iloc[:,0]

origin
Texas      Nighthawks
Arizona    Nighthawks
Name: regiment, dtype: object

**Step 17.** Select the third cell in the row named Arizona

In [0]:
#In the army variable we perform the logical operation and use loc and iloc
army.loc[["Arizona"]].iloc[:, 2]

origin
Arizona    523
Name: deaths, dtype: int64

**Step 18.** Select the third cell down in the column named deaths

In [0]:
#In the army variable we perform search and use loc and iloc
army.loc[:, ["deaths"]].iloc[2]

deaths    25
Name: Texas, dtype: int64

## ***Grouping***

### **Alcohol consumption**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** Import the dataset from this address.

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'


**Step 3.** Assign it to a variable called drinks.

In [0]:
#Create the variable drinks
drinks= pd.read_csv(dataset)
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

**Step 4.** Which continent drinks more beer on average?

In [0]:
#With the groupby method, the grouping of the requested elements is carried out 
#and with the mean method the average is obtained
drinks.groupby(drinks['continent']).beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

**Step 5.** For each continent print the statistics for wine consumption.

In [0]:
#With the groupby method, the grouping of the requested elements is carried out 
#with the describe method we obtain characteristics of what is consulted
drinks.groupby(drinks['continent']).wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

**Step 6.** Print the mean alcohol consumption per continent for every column.

In [0]:
#With the groupby method, the grouping of the requested elements is carried out 
#and with the mean method the mean is obtained
drinks.groupby(drinks['continent']).mean()

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF             61.471698  ...                      3.007547
AS             37.045455  ...                      2.170455
EU            193.777778  ...                      8.617778
OC             89.687500  ...                      3.381250
SA            175.083333  ...                      6.308333

[5 rows x 4 columns]

**Step 7.** Print the median alcohol consumption per continent for every column.

In [0]:
#With the groupby method, the grouping of the requested elements is carried out 
#and with the median method the median is obtained
drinks.groupby('continent').median()

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF                  32.0  ...                          2.30
AS                  17.5  ...                          1.20
EU                 219.0  ...                         10.00
OC                  52.5  ...                          1.75
SA                 162.5  ...                          6.85

[5 rows x 4 columns]

**Step 8.** Print the mean, min and max values for spirit consumption.

In [0]:
#Agg is used when a dataframe with group specific values is required
drinks.groupby('continent').spirit_servings.agg(['mean', 'min', 'max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

## ***Apply***

### **Student Alcohol Consumption**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np


**Step 2.** Import the dataset from this address.

In [0]:
#Assign the dataset variable the path of the repository where the file to be used is
dataset = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv'

**Step 3.** Assign it to a variable called df.

In [0]:
#Create the variable df
df = pd.read_csv(dataset)
df.head()

  school sex  age address famsize Pstatus  ...  Walc  health absences  G1  G2  G3
0     GP   F   18       U     GT3       A  ...     1       3        6   5   6   6
1     GP   F   17       U     GT3       T  ...     1       3        4   5   5   6
2     GP   F   15       U     LE3       T  ...     3       3       10   7   8  10
3     GP   F   15       U     GT3       T  ...     1       5        2  15  14  15
4     GP   F   16       U     GT3       T  ...     2       5        4   6  10  10

[5 rows x 33 columns]

**Step 4.** For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [0]:
#Loc is based on tagged positions of a dataframe, unlike iloc which is based on integer positions
ObjSchool= df.loc[: ,"school":"guardian"]
ObjSchool.head()

  school sex  age address famsize  ... Fedu     Mjob      Fjob  reason guardian
0     GP   F   18       U     GT3  ...    4  at_home   teacher  course   mother
1     GP   F   17       U     GT3  ...    1  at_home     other  course   father
2     GP   F   15       U     LE3  ...    1  at_home     other   other   mother
3     GP   F   15       U     GT3  ...    2   health  services    home   mother
4     GP   F   16       U     GT3  ...    3    other     other    home   father

[5 rows x 12 columns]

**Step 5.** Create a lambda function that will capitalize strings.

In [0]:
#A lambda function is a defined subroutine that is not bound to an identifier
ObjCapitalize= lambda x:x.capitalize()

**Step 6.** Capitalize both Mjob and Fjob.

In [0]:
#With the lambda function, capitalize the required columns
ObjSchool['Mjob'].apply(ObjCapitalize)
ObjSchool['Fjob'].apply(ObjCapitalize)

0       Teacher
1         Other
2         Other
3      Services
4         Other
         ...
390    Services
391    Services
392       Other
393       Other
394     At_home
Name: Fjob, Length: 395, dtype: object

**Step 7.** Print the last elements of the data set.

In [0]:
#The tail method returns the last n rows.
ObjSchool.tail()

    school sex  age address famsize  ... Fedu      Mjob      Fjob  reason guardian
390     MS   M   20       U     LE3  ...    2  services  services  course    other
391     MS   M   17       U     LE3  ...    1  services  services  course   mother
392     MS   M   21       R     GT3  ...    1     other     other  course    other
393     MS   M   18       R     LE3  ...    2  services     other  course   mother
394     MS   M   19       U     LE3  ...    1     other   at_home  course   father

[5 rows x 12 columns]

**Step 8.** Did you notice the original dataframe is still lowercase? Why is that? Fix it and capitalize Mjob and Fjob

In [0]:
#With the lambda function, capitalize the required columns
ObjSchool['Mjob']=ObjSchool['Mjob'].apply(ObjCapitalize)
ObjSchool['Fjob']=ObjSchool['Fjob'].apply(ObjCapitalize)

In [0]:
ObjSchool.tail()

    school sex  age address famsize  ... Fedu      Mjob      Fjob  reason guardian
390     MS   M   20       U     LE3  ...    2  Services  Services  course    other
391     MS   M   17       U     LE3  ...    1  Services  Services  course   mother
392     MS   M   21       R     GT3  ...    1     Other     Other  course    other
393     MS   M   18       R     LE3  ...    2  Services     Other  course   mother
394     MS   M   19       U     LE3  ...    1     Other   At_home  course   father

[5 rows x 12 columns]

**Step 9.** Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old).

In [0]:
def majority(x):
    if x > 17:
        return True
    else:
        return False
ObjSchool['legal_drinker'] = ObjSchool['age'].apply(majority)
ObjSchool.head()

  school sex  age address  ...      Fjob  reason  guardian  legal_drinker
0     GP   F   18       U  ...   Teacher  course    mother           True
1     GP   F   17       U  ...     Other  course    father          False
2     GP   F   15       U  ...     Other   other    mother          False
3     GP   F   15       U  ...  Services    home    mother          False
4     GP   F   16       U  ...     Other    home    father          False

[5 rows x 13 columns]

**Step 10.** Multiply every number of the dataset by 10.

In [0]:
def times(x):
    if type(x) is int:
        return 10 * x
    return x
ObjSchool.applymap(times).head(10)

  school sex  age address  ...      Fjob      reason  guardian  legal_drinker
0     GP   F  180       U  ...   Teacher      course    mother           True
1     GP   F  170       U  ...     Other      course    father          False
2     GP   F  150       U  ...     Other       other    mother          False
3     GP   F  150       U  ...  Services        home    mother          False
4     GP   F  160       U  ...     Other        home    father          False
5     GP   M  160       U  ...     Other  reputation    mother          False
6     GP   M  160       U  ...     Other        home    mother          False
7     GP   F  170       U  ...   Teacher        home    mother          False
8     GP   M  150       U  ...     Other        home    mother          False
9     GP   M  150       U  ...     Other        home    mother          False

[10 rows x 13 columns]

## ***Merge***

### **Auto MPG**

**Step 1.** Import the necessary libraries

In [0]:
#Import the pandas library and assign it to the variable pd
import pandas as pd
#Import the numpy library and assign it to the variable np
import numpy as np

**Step 2.** Import the first dataset cars1 and cars2.

In [0]:
dataset="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv"
dataset1="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv"

**Step 3.** Assign each to a to a variable called cars1 and cars2.

In [0]:
cars1 = pd.read_csv(dataset)
cars2 = pd.read_csv(dataset1)

In [0]:
cars1.head()

    mpg  cylinders  displacement  ... Unnamed: 11  Unnamed: 12  Unnamed: 13
0  18.0          8           307  ...         NaN          NaN          NaN
1  15.0          8           350  ...         NaN          NaN          NaN
2  18.0          8           318  ...         NaN          NaN          NaN
3  16.0          8           304  ...         NaN          NaN          NaN
4  17.0          8           302  ...         NaN          NaN          NaN

[5 rows x 14 columns]

In [0]:
cars2.head()

    mpg  cylinders  displacement  ... model  origin                 car
0  33.0          4            91  ...    76       3         honda civic
1  20.0          6           225  ...    76       1      dodge aspen se
2  18.0          6           250  ...    76       1   ford granada ghia
3  18.5          6           250  ...    76       1  pontiac ventura sj
4  17.5          6           258  ...    76       1       amc pacer d/l

[5 rows x 9 columns]

**Step 4.** Oops, it seems our first dataset has some unnamed blank columns, fix cars1.

In [0]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

    mpg  cylinders  displacement  ... model  origin                        car
0  18.0          8           307  ...    70       1  chevrolet chevelle malibu
1  15.0          8           350  ...    70       1          buick skylark 320
2  18.0          8           318  ...    70       1         plymouth satellite
3  16.0          8           304  ...    70       1              amc rebel sst
4  17.0          8           302  ...    70       1                ford torino

[5 rows x 9 columns]

**Step 5.** What is the number of observations in each dataset?

In [0]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

**Step 6.** Join cars1 and cars2 into a single DataFrame called cars

In [0]:
cars = cars1.append(cars2)
cars

      mpg  cylinders  displacement  ... model  origin                        car
0    18.0          8           307  ...    70       1  chevrolet chevelle malibu
1    15.0          8           350  ...    70       1          buick skylark 320
2    18.0          8           318  ...    70       1         plymouth satellite
3    16.0          8           304  ...    70       1              amc rebel sst
4    17.0          8           302  ...    70       1                ford torino
..    ...        ...           ...  ...   ...     ...                        ...
195  27.0          4           140  ...    82       1            ford mustang gl
196  44.0          4            97  ...    82       2                  vw pickup
197  32.0          4           135  ...    82       1              dodge rampage
198  28.0          4           120  ...    82       1                ford ranger
199  31.0          4           119  ...    82       1                 chevy s-10

[398 rows x 9 columns]

**Step 7.** Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [0]:
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([53225, 37275, 33406, 36389, 22234, 46203, 25782, 68556, 38490,
       47893, 64386, 17693, 58066, 16427, 44689, 69067, 36317, 35838,
       46101, 70435, 23749, 25696, 64298, 40528, 43847, 23357, 15553,
       16891, 49729, 31304, 42608, 47814, 44842, 21364, 33747, 22624,
       64131, 21255, 60503, 55454, 25170, 55252, 50722, 65023, 64161,
       42076, 49171, 45385, 53355, 24151, 30033, 37185, 38756, 27169,
       49539, 22159, 68140, 57659, 66747, 32978, 43881, 72055, 36767,
       40757, 16592, 19739, 33182, 18512, 53592, 63324, 70333, 47972,
       15605, 67496, 34482, 36237, 41945, 43522, 68551, 24286, 66610,
       34547, 33753, 72695, 50189, 27944, 58667, 47876, 31339, 46713,
       48202, 47707, 29743, 43373, 71589, 57311, 23388, 21677, 64962,
       45773, 43168, 51119, 46145, 53529, 50704, 72162, 26567, 56964,
       62870, 63973, 17123, 66463, 46978, 16726, 49615, 43959, 62456,
       54923, 55430, 57736, 62491, 29262, 59003, 43637, 63144, 44175,
       21725, 58412, 24171, 66426, 25725, 31462, 57790, 67623, 46858,
       59968, 69568, 24801, 39664, 54117, 53425, 17049, 49843, 70942,
       55914, 65893, 53411, 21844, 71477, 36981, 66151, 24847, 30031,
       42686, 66524, 64213, 28085, 30589, 21383, 20705, 33238, 25231,
       32768, 51454, 40675, 25952, 64228, 38608, 19193, 40685, 40480,
       20901, 60609, 22070, 52125, 54773, 49142, 70286, 39048, 35350,
       42160, 24189, 71431, 31762, 29184, 46322, 40715, 15598, 31564,
       30875, 32810, 56064, 50857, 52768, 55058, 37539, 21363, 16706,
       54521, 25734, 51692, 53690, 21808, 36650, 25790, 15656, 51850,
       31957, 72320, 68540, 30055, 31370, 40654, 30410, 23846, 20882,
       33893, 35611, 31082, 31707, 67381, 27391, 67745, 64596, 39643,
       46872, 29833, 36171, 21386, 18966, 68344, 32050, 70004, 71977,
       67968, 61033, 41144, 48634, 18043, 62995, 24280, 62937, 17860,
       20075, 64537, 31626, 47736, 47067, 44707, 17239, 32481, 48393,
       62927, 35546, 36198, 69114, 51829, 51750, 34345, 54360, 60921,
       35005, 56056, 56115, 63515, 65368, 50643, 33634, 19805, 59143,
       45615, 25285, 56866, 35429, 39634, 71537, 59232, 42135, 22196,
       26790, 44942, 41747, 43044, 28047, 39651, 57819, 34887, 33905,
       69305, 62582, 38725, 71176, 43166, 23876, 70070, 66310, 45953,
       64115, 24591, 40836, 49675, 62820, 21104, 20061, 59718, 38388,
       70752, 57671, 36510, 52987, 33882, 37757, 30031, 57578, 21495,
       29628, 55371, 17362, 44808, 38124, 49671, 58771, 28341, 24721,
       63722, 55624, 41363, 69675, 52290, 65567, 29332, 29031, 19443,
       59382, 17028, 38089, 52047, 49884, 67475, 23973, 54028, 48959,
       31784, 68215, 65485, 42739, 38293, 15928, 51482, 20750, 27256,
       15193, 64253, 18435, 21084, 69423, 30775, 50936, 58551, 34187,
       59165, 19188, 30221, 36916, 22614, 19818, 20920, 45239, 60505,
       54211, 64998, 69495, 22355, 34089, 24391, 67116, 62641, 62350,
       21396, 54352, 43046, 33377, 48331, 51982, 18807, 19833, 56036,
       39299, 48319, 43833, 66462, 42541, 29303, 19018, 20792, 43553,
       19639, 37113])

**Step 8.** Add the column owners to cars

In [0]:
cars['owners'] = nr_owners
cars.head()

    mpg  cylinders  displacement  ... origin                        car  owners
0  18.0          8           307  ...      1  chevrolet chevelle malibu   53225
1  15.0          8           350  ...      1          buick skylark 320   37275
2  18.0          8           318  ...      1         plymouth satellite   33406
3  16.0          8           304  ...      1              amc rebel sst   36389
4  17.0          8           302  ...      1                ford torino   22234

[5 rows x 10 columns]

## ***Stats***

### **US Baby Names**

**Step 1.** Import the necessary libraries.

In [0]:
import pandas as pd

**Step 2.** Import the dataset from this address.

In [0]:
dataset='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

**Step 3.** Assign it to a variable called baby_names.

In [0]:
baby_names = pd.read_csv(dataset)

**Step 4.** See the first 10 entries.

In [113]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

**Step 5.** Delete the column 'Unnamed: 0' and 'Id'.

In [114]:
# deletes Unnamed: 0
del baby_names['Unnamed: 0']
# deletes Unnamed: 0
baby_names.drop('Id',axis=1)
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

**Step 6.** Are there more male or female names in the dataset?

In [115]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

**Step 7.** Group the dataset by name and assign to names.

In [116]:
# you don't want to sum the Year column, so you delete it
del baby_names["Year"]
# group the data
names = baby_names.groupby("Name").sum()
# print the first 5 observations
names.head()
# print the size of the dataset
print(names.shape)
# sort it from the biggest value to the smallest one
names.sort_values("Count", ascending = 0).head()

(17632, 2)

                  Id   Count
Name
Jacob     1665681356  242874
Emma      1629482250  214852
Michael   1687521295  214405
Ethan     1660808475  209277
Isabella  1630131786  204798

**Step 8.** How many different names exist in the dataset?

**Step 9.** What is the name with most occurrences?

**Step 10.** How many different names have the least occurrences?

**Step 11.** What is the median name occurrence?

**Step 12.** What is the standard deviation of names?

**Step 13.** Get a summary with the mean, min, max, std and quartiles.